SELECT Κ.επιθετο, Κ.ονομα
FROM ΚΑΘΗΓΗΤΕΣ AS Κ INNER JOIN ΣΧΟΛΕΙΟ AS Σ ON Σ.κωδικος_σχολειου = Κ.fk1_κωδικος_σχολειου
WHERE Σ.Δήμος = 'Θεσσαλονίκης'
GROUP BY Κ.επιθετο, Κ.ονομα, Κ.αρ_ταυτοτ_καθ;

SELECT *
FROM ΜΑΘΗΤΕΣ AS Μ
WHERE Μ.επιθετο Like 'Β%';

SELECT Γ.fk1_Αρ_ταυτοτ_μαθ, Γ.τηλεφωνο_γονεα, Γ.διευθ_κατοικιας
FROM ΓΟΝΕΙΣ AS Γ;

SELECT AVG(Ε.Βαθμός), Μ.Αρ_ταυτοτ_μαθ
FROM εχουν_περασει AS Ε INNER JOIN ΜΑΘΗΤΕΣ AS Μ ON Μ.Αρ_ταυτοτ_μαθ = Ε.fk1_Αρ_ταυτοτ_μαθ
GROUP BY Μ.Αρ_ταυτοτ_μαθ
HAVING AVG(Ε.Βαθμός) > 10;

SELECT fk2_κωδικος_μαθηματος, COUNT(*) AS [COUNT]
FROM εχουν_περασει
GROUP BY fk2_κωδικος_μαθηματος;

SELECT fk1_κωδικος_σχολειου, ονομα, επιθετο, ειδικότητα, fk3_τμημα
FROM ΚΑΘΗΓΗΤΕΣ
WHERE ειδικότητα = 'ΜΑΘΗΜΑΤΙΚΑ'
ORDER BY fk1_κωδικος_σχολειου DESC;

SELECT Μ.Αρ_ταυτοτ_μαθ, Μ.fk1_τμημα, Μ.fk2_κωδικος_σχολειου
FROM εχουν_περασει AS Ε INNER JOIN ΜΑΘΗΤΕΣ AS Μ ON Μ.Αρ_ταυτοτ_μαθ = Ε.fk1_Αρ_ταυτοτ_μαθ
WHERE Ε.Βαθμός = (SELECT MAX(Π.Βαθμός)
		           FROM εχουν_περασει AS Π, ΜΑΘΗΤΕΣ AS Ν
		          WHERE Ν.Αρ_ταυτοτ_μαθ = Π.fk1_Αρ_ταυτοτ_μαθ
		          GROUP BY Ν.fk1_τμημα, Ν.fk2_κωδικος_σχολειου
		          HAVING Ν.fk1_τμημα = Μ.fk1_τμημα and Ν.fk2_κωδικος_σχολειου                       = Μ.fk2_κωδικος_σχολειου)
GROUP BY Μ.Αρ_ταυτοτ_μαθ, Μ.fk1_τμημα, Μ.fk2_κωδικος_σχολειου
ORDER BY Μ.fk2_κωδικος_σχολειου ASC, Μ.fk1_τμημα DESC;

SELECT Σ.κωδικος_σχολειου
FROM ΣΧΟΛΕΙΟ AS Σ LEFT JOIN ΚΑΘΗΓΗΤΕΣ AS Κ ON Σ.κωδικος_σχολειου = Κ.fk1_κωδικος_σχολειου
WHERE Κ.αρ_ταυτοτ_καθ IS NULL;
